; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v11 ?v9)
             (pred_12 ?v2 ?v7)
             (pred_3 ?v11 ?v7)
             (pred_2 ?v4 ?v11 )
	     (pred_4 ?v11)
             (pred_1 ?v13)
             (pred_6 ?v2)
             (pred_7 ?v7)
             (pred_10 ?v11)
             (pred_11 ?v2)
             (pred_8 ?v11)
             (pred_5 ))



(:action op_2
:parameters (?v12 ?v8 ?v6 ?v1)
:precondition (and (pred_1 ?v12) (pred_1 ?v8) (pred_6 ?v6) (pred_7 ?v1)
          (pred_9 ?v12 ?v8) (pred_12 ?v6 ?v1)
                   (pred_3 ?v8 ?v1) (pred_4 ?v12) 
                   (pred_10 ?v8) (pred_11 ?v6))
:effect (and  (pred_8 ?v8) (not (pred_10 ?v8))))


(:action op_1
:parameters (?v12 ?v3)
:precondition (and (pred_1 ?v12) (pred_1 ?v3)
               (pred_4 ?v12) (pred_9 ?v12 ?v3) (pred_8 ?v3))
:effect (and (pred_4 ?v3) (not (pred_4 ?v12))))

(:action op_4
:parameters (?v12 ?v6)
:precondition (and (pred_1 ?v12) (pred_6 ?v6) 
                  (pred_4 ?v12) (pred_2 ?v6 ?v12) (pred_5 ))
:effect (and (pred_11 ?v6)
   (not (pred_2 ?v6 ?v12)) (not (pred_5 ))))


(:action op_3
:parameters (?v12 ?v5 ?v10)
:precondition (and (pred_1 ?v12) (pred_6 ?v5) (pred_6 ?v10)
                  (pred_4 ?v12) (pred_11 ?v10) (pred_2 ?v5 ?v12))
:effect (and (pred_11 ?v5) (pred_2 ?v10 ?v12)
        (not (pred_11 ?v10)) (not (pred_2 ?v5 ?v12))))

(:action op_5
:parameters (?v12 ?v6)
:precondition (and (pred_1 ?v12) (pred_6 ?v6) 
                  (pred_4 ?v12) (pred_11 ?v6))
:effect (and (pred_5 ) (pred_2 ?v6 ?v12) (not (pred_11 ?v6)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_03 obj_01 obj_29 obj_22 obj_25 obj_15 obj_05 obj_09 obj_21 obj_30 obj_27 obj_11 obj_19 obj_24 obj_06 obj_26 obj_23 obj_07 obj_18 obj_12 obj_14 obj_13 obj_10 obj_02 obj_17
    obj_20 obj_08 obj_04
    obj_28 obj_32 obj_16 obj_31
    )

    (:init
       (pred_5)

       (pred_1 obj_03)
       (pred_1 obj_01)
       (pred_1 obj_29)
       (pred_1 obj_22)
       (pred_1 obj_25)
       (pred_1 obj_15)
       (pred_1 obj_05)
       (pred_1 obj_09)
       (pred_1 obj_21)
       (pred_1 obj_30)
       (pred_1 obj_27)
       (pred_1 obj_11)
       (pred_1 obj_19)
       (pred_1 obj_24)
       (pred_1 obj_06)
       (pred_1 obj_26)
       (pred_1 obj_23)
       (pred_1 obj_07)
       (pred_1 obj_18)
       (pred_1 obj_12)
       (pred_1 obj_14)
       (pred_1 obj_13)
       (pred_1 obj_10)
       (pred_1 obj_02)
       (pred_1 obj_17)
       (pred_7 obj_20)
       (pred_7 obj_08)
       (pred_7 obj_04)
       (pred_6 obj_28)
       (pred_6 obj_32)
       (pred_6 obj_16)
       (pred_6 obj_31)

       (pred_9 obj_03 obj_15)
       (pred_9 obj_03 obj_01)
       (pred_9 obj_01 obj_05)
       (pred_9 obj_01 obj_29)
       (pred_9 obj_01 obj_03)
       (pred_9 obj_29 obj_09)
       (pred_9 obj_29 obj_22)
       (pred_9 obj_29 obj_01)
       (pred_9 obj_22 obj_21)
       (pred_9 obj_22 obj_25)
       (pred_9 obj_22 obj_29)
       (pred_9 obj_25 obj_30)
       (pred_9 obj_25 obj_22)
       (pred_9 obj_15 obj_27)
       (pred_9 obj_15 obj_05)
       (pred_9 obj_15 obj_03)
       (pred_9 obj_05 obj_11)
       (pred_9 obj_05 obj_09)
       (pred_9 obj_05 obj_01)
       (pred_9 obj_05 obj_15)
       (pred_9 obj_09 obj_19)
       (pred_9 obj_09 obj_21)
       (pred_9 obj_09 obj_29)
       (pred_9 obj_09 obj_05)
       (pred_9 obj_21 obj_24)
       (pred_9 obj_21 obj_30)
       (pred_9 obj_21 obj_22)
       (pred_9 obj_21 obj_09)
       (pred_9 obj_30 obj_06)
       (pred_9 obj_30 obj_25)
       (pred_9 obj_30 obj_21)
       (pred_9 obj_27 obj_26)
       (pred_9 obj_27 obj_11)
       (pred_9 obj_27 obj_15)
       (pred_9 obj_11 obj_23)
       (pred_9 obj_11 obj_19)
       (pred_9 obj_11 obj_05)
       (pred_9 obj_11 obj_27)
       (pred_9 obj_19 obj_07)
       (pred_9 obj_19 obj_24)
       (pred_9 obj_19 obj_09)
       (pred_9 obj_19 obj_11)
       (pred_9 obj_24 obj_18)
       (pred_9 obj_24 obj_06)
       (pred_9 obj_24 obj_21)
       (pred_9 obj_24 obj_19)
       (pred_9 obj_06 obj_12)
       (pred_9 obj_06 obj_30)
       (pred_9 obj_06 obj_24)
       (pred_9 obj_26 obj_14)
       (pred_9 obj_26 obj_23)
       (pred_9 obj_26 obj_27)
       (pred_9 obj_23 obj_13)
       (pred_9 obj_23 obj_07)
       (pred_9 obj_23 obj_11)
       (pred_9 obj_23 obj_26)
       (pred_9 obj_07 obj_10)
       (pred_9 obj_07 obj_18)
       (pred_9 obj_07 obj_19)
       (pred_9 obj_07 obj_23)
       (pred_9 obj_18 obj_02)
       (pred_9 obj_18 obj_12)
       (pred_9 obj_18 obj_24)
       (pred_9 obj_18 obj_07)
       (pred_9 obj_12 obj_17)
       (pred_9 obj_12 obj_06)
       (pred_9 obj_12 obj_18)
       (pred_9 obj_14 obj_13)
       (pred_9 obj_14 obj_26)
       (pred_9 obj_13 obj_10)
       (pred_9 obj_13 obj_23)
       (pred_9 obj_13 obj_14)
       (pred_9 obj_10 obj_02)
       (pred_9 obj_10 obj_07)
       (pred_9 obj_10 obj_13)
       (pred_9 obj_02 obj_17)
       (pred_9 obj_02 obj_18)
       (pred_9 obj_02 obj_10)
       (pred_9 obj_17 obj_12)
       (pred_9 obj_17 obj_02)
       (pred_10 obj_01)
       (pred_10 obj_18)
       (pred_10 obj_24)
       (pred_10 obj_02)
       (pred_3  obj_01 obj_20)
       (pred_3  obj_18 obj_08)
       (pred_3  obj_24 obj_04)
       (pred_3  obj_02 obj_04)
       (pred_8 obj_03)
       (pred_8 obj_29)
       (pred_8 obj_22)
       (pred_8 obj_25)
       (pred_8 obj_15)
       (pred_8 obj_05)
       (pred_8 obj_09)
       (pred_8 obj_21)
       (pred_8 obj_30)
       (pred_8 obj_27)
       (pred_8 obj_11)
       (pred_8 obj_19)
       (pred_8 obj_06)
       (pred_8 obj_26)
       (pred_8 obj_23)
       (pred_8 obj_07)
       (pred_8 obj_12)
       (pred_8 obj_14)
       (pred_8 obj_13)
       (pred_8 obj_10)
       (pred_8 obj_17)

       (pred_12  obj_28 obj_20)
       (pred_12  obj_32 obj_08)
       (pred_12  obj_16 obj_04)
       (pred_12  obj_31 obj_08)
       (pred_2 obj_28 obj_14)
       (pred_2 obj_32 obj_05)
       (pred_2 obj_16 obj_12)
       (pred_2 obj_31 obj_21)
       (pred_4 obj_03)
    )

    (:goal (and
       (pred_2 obj_28 obj_26)
       (pred_2 obj_31 obj_09)
    ))
(:constraints
  (always (not (pred_4 obj_27)))
)
)

; plan
1. (op_1 obj_03 obj_15)
   deleted: (pred_4 obj_03)
   added: (pred_4 obj_15)
   goals met: 0 of 2
2. (op_1 obj_15 obj_05)
   deleted: (pred_4 obj_15)
   added: (pred_4 obj_05)
   goals met: 0 of 2
3. (op_1 obj_05 obj_09)
   deleted: (pred_4 obj_05)
   added: (pred_4 obj_09)
   goals met: 0 of 2
4. (op_1 obj_09 obj_21)
   deleted: (pred_4 obj_09)
   added: (pred_4 obj_21)
   goals met: 0 of 2
5. (op_4 obj_21 obj_31)
   deleted: (pred_2 obj_31 obj_21) (pred_5)
   added: (pred_11 obj_31)
   goals met: 0 of 2
6. (op_1 obj_21 obj_09)
   deleted: (pred_4 obj_21)
   added: (pred_4 obj_09)
   goals met: 0 of 2
7. (op_5 obj_09 obj_31)
   deleted: (pred_11 obj_31)
   added: (pred_5) (pred_2 obj_31 obj_09)
   goals met: 1 of 2
8. (op_1 obj_09 obj_05)
   deleted: (pred_4 obj_09)
   added: (pred_4 obj_05)
   goals met: 1 of 2
9. (op_4 obj_05 obj_32)
   deleted: (pred_2 obj_32 obj_05) (pred_5)
   added: (pred_11 obj_32)
   goals met: 1 of 2
10. (op_1 obj_05 obj_11)
   deleted: (pred_4 obj_05)
   added: (pred_4 obj_11)
   goals met: 1 of 2
11. (op_1 obj_11 obj_23)
   deleted: (pred_4 obj_11)
   added: (pred_4 obj_23)
   goals met: 1 of 2
12. (op_1 obj_23 obj_26)
   deleted: (pred_4 obj_23)
   added: (pred_4 obj_26)
   goals met: 1 of 2
13. (op_1 obj_26 obj_14)
   deleted: (pred_4 obj_26)
   added: (pred_4 obj_14)
   goals met: 1 of 2
14. (op_3 obj_14 obj_28 obj_32)
   deleted: (pred_11 obj_32) (pred_2 obj_28 obj_14)
   added: (pred_11 obj_28) (pred_2 obj_32 obj_14)
   goals met: 1 of 2
15. (op_1 obj_14 obj_26)
   deleted: (pred_4 obj_14)
   added: (pred_4 obj_26)
   goals met: 1 of 2
16. (op_5 obj_26 obj_28)
   deleted: (pred_11 obj_28)
   added: (pred_5) (pred_2 obj_28 obj_26)
   goals met: 2 of 2
